function toCase() {
  // в общем виде задача решена быть не может
  // поскольку невозможно для множества всех слов одинаково и однозначно определить окончание.
  // Различные слова будут иметь различные окончания в одном падеже, например,
  // в родительном падеже, множественном числе 112 сообщенИЙ, 112 мужчИН, 112 арбузОВ.
  // Так же могут встретиться фамилии, изменение окончания которых зависит, например, от пола.
  // Считаю, что в случае необходимости изменения падежей слов в каком-либо месте страницы, перечень этих слов заранее может быть известен.
  // Поэтому быстрее сделать функцию для обработки этого списка слов
}
